app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE (created_at >= '2017-05-23 00:00:00') AND ("orders"."aasm_state" != ?) ORDER BY created_at DESC  [["aasm_state", "completed"]]
---
  def index
    @orders = Order.where("created_at >= ?", Time.zone.now.beginning_of_day).where.not(:aasm_state => 'completed').order('created_at DESC')

INSERT INTO "orders" ("name", "aasm_state", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test 555"], ["aasm_state", "received"], ["created_at", "2017-05-23 01:51:40.660972"], ["updated_at", "2017-05-23 01:51:40.660972"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save